from aiogram.utils.markdown import hbold

help_text = {
    0: f"{hbold('Реєстрація')}\n * Для реєстрації потрібно надіслати повідомлення боту командою /create. Ви отримаєте "
       "повідомлення з клавіатурою з вибором країни.\n * Напишіть свій ігровий псевдонім.\n * Виберіть "
       "клас для свого персонажа.\n * Підтвердіть, якщо ви згодні зі своїм характером.\n * Після реєстрації ви "
       f"отримаєте повідомлення з інформацією про місто, де ви знаходитесь.\n\n "
       f"{hbold('Ви можете видалити свій обліковий')} "
       f"{hbold('запис у будь-який момент, надіславши повідомлення боту за допомогою команди /delete.')}",
    1: f"{hbold('Місто')}\n * Ви можете відвідати будь-який міський об’єкт, натиснувши кнопки на клавіатурі."
       "Там ви можете підвищити свій рівень, статистику, купувати предмети.",
    2: f"{hbold('Дороги')}\n * Дороги – це основний шлях до інших міст чи об’єктів."
       "Для подорожі потрібна ваша енергія, яку ви можете відновити в таверні.",
    3: f"{hbold('Характеристики')}\n * Є чотири характеристики вашого характеру: сила, спритність, розум "
       "та інтуїція.\n * Їхні базові значення залежать від вибраного вами класу і мають обмеження на ваш рівень."
       "\n * Ви можете підвищити свої характеристики, відвідуючи різні об'єкти.",
    4: f"{hbold('Їздові тварини')}\n * Ці коні є основним засобом пересування. Ви можете їздити на них, щоб "
       "відправитися в інші міста або об'єкти. У ігровій логіці ви витрачаєте менше енергії на подорожі."
       " Їх можна купити у звіринці.",
    5: f"{hbold('Підземелля')}\n * Це місце, де ви можете знайти монстрів. Ви можете битися з ними і отримувати "
       "нагороди.\n * Тут ви можете отримати інформацію про підземелля, нагороди, пошкодження і скільки часу "
       "потрібно, щоб пройти.\n * Після входу в підземелля потрібно почекати час, щоб завершити його. Поки ви "
       "перебуваєте в підземеллі, ви не можете подорожувати.",
    6: f"{hbold('Рейди')}\n * Рейди схожі на підземелля, але вони складніші, тому що в них потрібно пройти більше "
       "рівнів.\n * Тут ви також можете отримати інформацію про рейд, нагороди, збиток і скільки часу потрібно для "
       "його завершення.\n * Ви також можете будь-коли отримати інформацію про наступний рівень рейду.",
}
